In [1]:
import pandas as pd

In [2]:
df1 = pd.read_csv('demographics.csv')
df1

    name  age sex
0   zack   11   m
1  drake   21   m
2    dan   13   m
3   wini   19   f
4    jon   19   m
5   ryan   14   m
6    gio   14   f

In [3]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
name    7 non-null object
age     7 non-null int64
sex     7 non-null object
dtypes: int64(1), object(2)
memory usage: 248.0+ bytes

In [4]:
df1.describe().T

     count       mean       std   min   25%   50%   75%   max
age    7.0  15.857143  3.760699  11.0  13.5  14.0  19.0  21.0

In [5]:
# one hot encoding
df1['is_female'] = df1.sex.map({'f':1, 'm':0})
df1

    name  age sex  is_female
0   zack   11   m          0
1  drake   21   m          0
2    dan   13   m          0
3   wini   19   f          1
4    jon   19   m          0
5   ryan   14   m          0
6    gio   14   f          1

In [6]:
# drop sex column
df1 = df1.drop(columns=['sex'])
df1

    name  age  is_female
0   zack   11          0
1  drake   21          0
2    dan   13          0
3   wini   19          1
4    jon   19          0
5   ryan   14          0
6    gio   14          1

In [7]:
# filter out kids
df1 = df1[df1.age >= 18]
df1

    name  age  is_female
1  drake   21          0
3   wini   19          1
4    jon   19          0

In [8]:
# mean adult age
df1.age.mean()

19.666666666666668

In [9]:
# sex breakdown
df1.is_female.value_counts()

0    2
1    1
Name: is_female, dtype: int64